routes/web.php


Route::get('/', function () {

    $user = User::find(1);

    $post = $user->posts()->create([
        'content' => 'from welcome route'
    ]);
    $post->tags()->attach(1);
---
select * from `users` where `users`.`id` = 1 limit 1
insert into `posts` (`content`, `user_id`, `updated_at`, `created_at`) values ('from welcome route', 1, '2024-05-11 15:11:09', '2024-05-11 15:11:09')
insert into `post_tag` (`created_at`, `post_id`, `tag_id`, `updated_at`) values ('2024-05-11 15:11:09', 7, 1, '2024-05-11 15:11:09')