routes/web.php


Route::get('/', function () {

    $learn = Affiliation::find(1);
    $learn->posts()->get();
---
select * from `affiliations` where `affiliations`.`id` = 1 limit 1
select `posts`.*, `users`.`affiliation_id` as `laravel_through_key` from `posts` inner join `users` on `users`.`id` = `posts`.`user_id` where `users`.`affiliation_id` = 1